
%% a

?- delete_one(2,[1,2,3,2,2,3],Res).
Res = [1, 3, 2, 2, 3].

?- delete_one(2,[2,2,2,2,2,3],Res).
Res = [2, 2, 2, 2, 3].

%% b

?- delete_all(2,[1,2,2,3],Res).
Res = [1, 3] ;
false.

?- delete_all(2,[1,2,2,3,2,444,5,5,1,2,2],Res).
Res = [1, 3, 444, 5, 5, 1] ;
false.
